# Написати програму, яка обраховує вік користувача, базуючись на даті народження у певному форматі
# Програма має видавати вік, або видавати "-1" у випадку некоректної вхідної інформації


# Ви маєте дописати частину, де вхідна інформація перевіряється на коректність
# та записує у змінну result очікуване значення - кількість років людини, або -1.

class Calculator
  def console_calculator

      # Остаточний вік користувача програми
      result = 0

      # Вивід інформаційного повідомлення
      puts "Програма обчислить ваш вік"
      puts "Введіть дату свого народження у такому форматі дд-мм-рррр"
      
      # Зчитування даних з консолі
      dob = gets.chomp

      # Формування масиву, внаслідок дії методу split (поділити) класу String
      dob = dob.split "-"

      # Ініціалізації змінних, в яких міститься інформація про рік, місяць та день народження користувача
      dob_year = dob[2]
      dob_month = dob[1]
      dob_day = dob[0]

      # Використання вбудованого об’єкту Time для знаходження поточної дати
      current_time = Time.new

      # Ініціалізації змінних, в яких міститься інформація про рік, місяць та день місяця
      current_year = current_time.year
      current_month = current_time.month
      current_day = current_time.day
      
    	# Алгоритм

      # Перевірка вхідних даних на правильність та обчислення дати народження.
      # Поелементний аналіз базується на порівнянні послідовно років, місяців, днів місяця.
        y = current_year.to_i
        m = current_month.to_i
        d = current_day.to_i
        dy= dob_year.to_i
        dm= dob_month.to_i
        dd= dob_day.to_i
        
        
        if dy > y || dy < 1903
            puts "Невірна дата"
        elsif dy >= y && dm > m
            puts "Невірна дата"
        elsif dy >= y && dm >= m && dd > d
            puts "Невірна дата"
        end
        r= y - dy
        if m < dm
            r -= 1  
        elsif m == dm && d < dd
            r -= 1
        end
        if r==0
            puts "<1"
        else result = r
        puts result;
        end

  end
end

