#Кожна планета має свій номер (порядок від Сонця). За заданим значенням номера повернути назва планети.

puts"Добрий день,введіть номер планети (від 1 до 8) !\n"
planet = ["1","2","3","4","5","6","7","8"]
number=gets.chomp
#Перевіряємо на правильність введення
if (!planet.include? number)
    puts "Введено неправильно!"
else
    case number.to_i
    when 1
        puts "Меркурій\n"
    when 2
        puts "Венера\n"
    when 3
        puts "Земля\n"
    when 4
        puts "Марс\n"
    when 5
        puts "Юпітер\n"
    when 6
        puts "Сатурн\n"
    when 7
        puts "Уран\n"
    when 8
        puts "Нептун\n"
    end
end

puts "Назви легко вивчити за поговіркою:\n"
puts "Мама Всегда Запрещала Мне Юному Следопыту Узнавать Названия"