#Функція отримає два параметри – цілі числа (жодне не дорівнює нулю, друге не повинно дорівнювати 1). 
#Сформувати вираз у вигляді ax^k, де а буде результатом множення аргументів, а показник степеня – це число,
#на одиницю менше за другий аргумент. Наприклад, function4(4, 7) має повернути рядок 28x^6.
def funk b,c
    a= b*c  
    k= c-1
    puts "#{ a }x^#{k}"
    
end
puts "Введіть два числа через пробіл"
ch= gets.chomp
ch=ch.split (" ")
b, c = ch[0].to_i, ch[1].to_i
if b == 0 || c == 0
    puts "Числа мають бути більше 0"
elsif c == 1
    puts "Друге число не повинне дорівнювати одиниці"
end
funk b,c
    